# Задача 10: 
# На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
# Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 
# Выведите минимальное количество монет, которые нужно перевернуть



# tails = 0 
# eagle = int(input('Введите количество монет: '))
# for coin in range(eagle): 
#     tails += int(input('Введите: Орел = 1, или решка = 0: ')) 
# print("Переверните" )
# print(min(tails, eagle - tails))
# print("монет" )


# ////////////////////////////////////////////////////////////////////////////////


# Задача 12:
#  Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике.
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. 
# Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.


# sum = int(input('Cумма двух чисел \n'))
# pro = int(input('Произведение чисел \n'))
# for x in range(sum):
#     for y in range(pro):
#         if sum == x + y and pro == x * y:
#             print(f'первое число ="{x}", второе число ="{y}"')


# ////////////////////////////////////////////////////////////////////////////////

# Задача 14: 
# Требуется вывести все целые степени двойки (т.е. числа вида 2^k), не превосходящие числа N.


# n = int(input('Введите число: '))
# p = 1
# while p <= n:
#     print(p, end=' ')
#     p = p * 2